Repository: rogerio-gelonezi/rabbitmq-post-api
Catalog: src/MessageBus.Engine/Properties/Resources.*.resx
Languages: pt_br

# Queue_Connection_With_Success
source: Connection successfully made to queue {0}.
pt_br: Conexão feita com sucesso na fila {0}.

# Queue_Connection_With_Error
source: Error connecting to queue {0}. Details: {1}.
pt_br: Erro ao conectar-se à fila {0}. Detalhes: {1}.

# Model_Created_With_Success
source: MessageBus Model successfully created.
pt_br: Model do MessageBus criado com sucesso.

# Model_Created_With_Error
source: Error creating the MessageBus Model. Details: {0}.
pt_br: Erro ao criar o Model do MessageBus. Detalhes: {0}.

# MessageBus_Connection_With_Success
source: Connection to MessageBus completed successfully.
pt_br: Conectado com sucesso ao MessageBus.

# MessageBus_Connection_Lost
source: Connection to MessageBus was lost.
pt_br: Conexão com MessageBus foi perdida.

# MessageBus_Connection_Attempt
source: MessageBus connection attempt number {0}.
pt_br: Tentativa de conexão número {0} ao MessageBus.

# MessageBus_Connection_Error
source: Error connecting to MessageBus: Details: {0}.
pt_br: Erro ao conectar no MessageBus: Detalhes: {0}.

# Publishing_To_Queue
source: Publishing message to queue {0}.
pt_br: Publicando mensagem na fila {0}.

# Publishing_To_Queue_With_Error
source: Error publishing message to queue {0}. Details: {1}
pt_br: Erro ao publicar mensagem na fila {0}. Detalhes: {1}

# Validator_Options_Hostname
source: RabbitMQ hostname was not provided in the environment variables, see the project README.
pt_br: Hostname do RabbitMQ não foi informada nas variáveis de ambiente, consulte o README do projeto.

# Validator_Options_Username
source: RabbitMQ username was not provided in the environment variables, see the project README.
pt_br: Username do RabbitMQ não foi informado nas variáveis de ambiente, consulte o README do projeto.

# Validator_Options_Password
source: RabbitMQ password was not provided in the environment variables, see the project README.
pt_br: Senha do RabbitMQ não foi informado nas variáveis de ambiente, consulte o README do projeto.

# ChannelPool_MessageBus_Insertion
source: MessageBus inserted into cache for queue {0}.
pt_br: MessageBus inserido no cache para a fila {0}.

# ChannelPool_MessageBus_Retrieved
source: MessageBus retrieved from cache to queue {0}.
pt_br: MessageBus recuperado do cache para a fila {0}.
